<?php
return [
    "ar" => [
        // layout
        'login' => 'تسجيل الدخول',
        'register' => 'تسجيل',
        'summarizer' => 'الملخص',
        'history' => 'السجل',
        'logout' => 'تسجيل الخروج',
        '2024 text recap. all rights reserved.' => '2024 text recap. جميع الحقوق محفوظة.',

        // summarize
        'full text' => 'النص الكامل',
        'summarized text' => 'النص الملخص',
        'model:' => 'نموذج:',
        'extractive' => 'استخلاص',
        'abstractive' => 'تجريدي',
        'small' => 'صغير',
        'medium' => 'متوسط',
        'large' => 'كبير',
        'summarize' => 'تلخيص',
        'word count:' => 'عدد الكلمات:',
        'sentence count:' => 'عدد الجمل:',
        'like' => 'إعجاب',
        'dislike' => 'عدم الإعجاب',

        // feedback
        'thanks for your feedback! 🙌' => 'شكرًا لتعليقاتك! 🙌',
        'we appreciate your input and will take it into consideration.' => 'نحن نقدر ملاحظاتك وسنأخذها في الاعتبار.',
        'summarize another one' => 'تلخيص آخر',

        // edit profile
        'upload image' => 'تحميل الصورة',
        'full name' => 'الاسم الكامل',
        'language:' => 'اللغة:',
        'old password' => 'كلمة المرور القديمة',
        'password' => 'كلمة المرور',
        'confirm password' => 'تأكيد كلمة المرور',
        'save changes' => 'حفظ التغييرات',

        // history
        'welcome,' => 'أهلاً،',
        'text' => 'النص',
        'cleaned text' => 'النص المنظف',
        'summary' => 'الملخص',
        'length' => 'الطول',
        'model' => 'نموذج',
        'date' => 'التاريخ',
        'previous' => 'السابق',
        'next' => 'التالي',

        // apis
        'apis management' => 'إدارة واجهات برمجة التطبيقات',
        'api name' => 'اسم واجهة برمجة التطبيقات',
        'create api' => 'إنشاء واجهة برمجة التطبيقات',
        'id' => 'معرّف',
        'url' => 'الرابط',
        'manage' => 'إدارة',
        'edit api' => 'تعديل واجهة برمجة التطبيقات',
        'close' => 'إغلاق',
        'save changes' => 'حفظ التغييرات',
        'delete api' => 'حذف واجهة برمجة التطبيقات',
        'are you sure you want to delete this api?' => 'هل أنت متأكد أنك تريد حذف هذه الواجهة؟',
        'cancel' => 'إلغاء',
        'delete' => 'حذف',

        //auth
        'email' => 'البريد الإلكتروني',
        'enter your name' => 'أدخل اسمك',
        'enter your email' => 'أدخل عنوان بريدك الإلكتروني',
        'enter your password' => 'أدخل كلمة المرور',
        'don\'t have an account?' => 'لا تمتلك حساباً؟',
        'register now' => 'سجل الآن',
        'already have an account?' => 'عندك حساب بالفعل؟',
        'name' => 'الاسم',
        'confirm your password' => 'تأكيد كلمة المرور',
        'enter your old password' => 'أدخل كلمة المرور القديمة',
        //apis
        'enter api name' => 'أدخل اسم الواجهه',
        //errors
        'text length must be more than 100 char' => 'يجب أن يكون طول النص أكثر من 100 حرف',
        'failed to move uploaded file' => 'فشل في نقل الملف المرفوع',
        'invalid email format' => 'صيغة البريد الإلكتروني غير صالحة',
        'password is required' => 'كلمة المرور مطلوبة',
        'invalid email or password' => 'البريد الإلكتروني أو كلمة المرور غير صحيحة',
        'name can\'t be empty' => 'لا يمكن أن يكون الاسم فارغاً',
        'email can\'t be empty' => 'لا يمكن أن يكون البريد الإلكتروني فارغاً',
        'email already exists' => 'البريد الإلكتروني موجود بالفعل',
        'password can\'t be empty' => 'لا يمكن أن تكون كلمة المرور فارغة',
        'password should be at least 6 characters long' => 'يجب أن تكون كلمة المرور على الأقل 6 أحرف',
        'confirm password should be the same as password' => 'يجب أن تكون تأكيد كلمة المرور مطابقة لكلمة المرور',
    ]
];
